apache/mynewt-core/hw/drivers/i2s/sai_stm32/src/sai_stm32.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <os/mynewt.h>
#include <mcu/mcu.h>
#include <mcu/stm32_hal.h>
#include <mcu/stm32_pin_cfg.h>
#include <bsp/bsp.h>
#include <i2s/i2s.h>
#include <i2s/i2s_driver.h>
#include <sai_stm32/sai_stm32.h>
#include <mcu/stm32_clock.h>

#include "stm32h5xx_hal_sai.h"
#include "stm32h5xx_hal_dma.h"
#include "stm32h5xx_hal_dma_ex.h"
#include "stm32h5xx_ll_dma.h"

struct stm32_sai {
    SAI_HandleTypeDef hsai;
    DMA_HandleTypeDef *hdma_sai_tx;
    DMA_HandleTypeDef *hdma_sai_rx;

    struct i2s *i2s;
    stm32_clock_t clock;
    const irq_cfg_t *irq_cfg;
    struct i2s_sample_buffer *dma_buffers[2];
    DMA_QListTypeDef dma_list;
    DMA_NodeTypeDef nodes[2];
    uint8_t dma_buffer_count;
#ifdef STM32_SAI_STATS
    uint32_t frames;
    uint32_t missed_frames;
#endif
};

/* SPI_I2S_FULLDUPLEX_SUPPORT is defined (or not) in ST provided MCU specific header */
#define I2S_FULLDUPLEX_SUPPORT  0

static uint16_t zero_buffer[96];

const DMA_InitTypeDef sai_a_tx_dma_init = {
    .Request = GPDMA1_REQUEST_SAI1_A,
    .BlkHWRequest = DMA_BREQ_SINGLE_BURST,
    .Direction = DMA_MEMORY_TO_PERIPH,
    .SrcInc = DMA_SINC_INCREMENTED,
    .DestInc = DMA_DINC_FIXED,
    .SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD,
    .DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD,
    .SrcBurstLength = 1,
    .DestBurstLength = 1,
    .TransferEventMode = DMA_TCEM_BLOCK_TRANSFER,
    .Priority = DMA_LOW_PRIORITY_LOW_WEIGHT,
    .Mode = DMA_LINKEDLIST_CIRCULAR,
};

const DMA_InitTypeDef sai_b_tx_dma_init = {
    .Request = GPDMA1_REQUEST_SAI1_B,
    .BlkHWRequest = DMA_BREQ_SINGLE_BURST,
    .Direction = DMA_MEMORY_TO_PERIPH,
    .SrcInc = DMA_SINC_INCREMENTED,
    .DestInc = DMA_DINC_FIXED,
    .SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD,
    .DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD,
    .SrcBurstLength = 1,
    .DestBurstLength = 1,
    .TransferEventMode = DMA_TCEM_BLOCK_TRANSFER,
    .Priority = DMA_LOW_PRIORITY_LOW_WEIGHT,
    .Mode = DMA_LINKEDLIST_CIRCULAR,
};

const DMA_InitTypeDef sai_a_rx_dma_init = {
    .Request = GPDMA1_REQUEST_SAI1_A,
    .BlkHWRequest = DMA_BREQ_SINGLE_BURST,
    .Direction = DMA_PERIPH_TO_MEMORY,
    .SrcInc = DMA_SINC_FIXED,
    .DestInc = DMA_DINC_INCREMENTED,
    .SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD,
    .DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD,
    .SrcBurstLength = 1,
    .DestBurstLength = 1,
    .TransferEventMode = DMA_TCEM_BLOCK_TRANSFER,
    .Priority = DMA_LOW_PRIORITY_LOW_WEIGHT,
    .Mode = DMA_LINKEDLIST_CIRCULAR,
};

const DMA_InitTypeDef sai_b_rx_dma_init = {
    .Request = GPDMA1_REQUEST_SAI1_B,
    .BlkHWRequest = DMA_BREQ_SINGLE_BURST,
    .Direction = DMA_PERIPH_TO_MEMORY,
    .SrcInc = DMA_SINC_FIXED,
    .DestInc = DMA_DINC_INCREMENTED,
    .SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD,
    .DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD,
    .SrcBurstLength = 1,
    .DestBurstLength = 1,
    .TransferEventMode = DMA_TCEM_BLOCK_TRANSFER,
    .Priority = DMA_LOW_PRIORITY_LOW_WEIGHT,
    .Mode = DMA_LINKEDLIST_CIRCULAR,
};

void
nvic_config_isr(const irq_cfg_t *cfg)
{
    NVIC_SetVector(cfg->irqn, (uint32_t)(cfg->isr));
    HAL_NVIC_SetPriority(cfg->irqn, cfg->pri, cfg->sub_pri);
    HAL_NVIC_EnableIRQ(cfg->irqn);
}

struct stm32_sai_cfg {
    uint8_t sai_num;
    SAI_TypeDef *sai;
    IRQn_Type sai_irq;
    struct stm32_sai *driver_data;
    DMA_HandleTypeDef *hdma_sai_rx;
    DMA_HandleTypeDef *hdma_sai_tx;
    void (*sai_irq_handler)(void);
    void (*sai_dma_handler)(void);
    void (*enable_clock)(bool enable);
};

#define SAI_IRQ_DEFINE(sai) \
void sai_IRQHandler(void);\
const irq_cfg_t sai##_irq_def = {\
    .irqn = sai##_IRQn,\
    .pri = 1,\
    .sub_pri = 0,\
    .isr = sai##_IRQHandler,\
}

#define DMA_IRQN(dma, ch) GPDMA##dma##_Channel##ch##_IRQn

#define SAI_DMA_ISR_DEFINE(sai, dma, ch, dir) \
void sai##_##dir##_dma_isr(void);\
const irq_cfg_t sai##_##dir##_dma##dma##_Channel##ch##_irq_cfg = {\
    .irqn = DMA_IRQN(dma, ch),\
    .pri = 1,\
    .isr = sai##_##dir##_dma_isr,\
};

#define SAI_DMA_CFG_DEFINE(sai, dma, ch, dir) \
stm32_dma_cfg_t sai##_##dir##_GPDMA##dma##_Channel##ch##_cfg = {\
    .dma_num = dma,\
    .irq_cfg = &sai##_##dir##_dma##dma##_Channel##ch##_irq_cfg,\
    .clock = PER_CLOCK(GPDMA##dma),\
    .dma_channel =  &sai##_##dir##_GPDMA##dma##_Channel##ch,\
}

#define SAI_DMA_TX_DEFINE(sai, dma, ch) \
SAI_DMA_ISR_DEFINE(sai, dma, ch, tx)\
DMA_HandleTypeDef sai##_tx_GPDMA##dma##_Channel##ch = {\
    .Instance = GPDMA##dma##_Channel##ch,\
    .Init = {\
        .Request = GPDMA1_REQUEST_##sai,\
        .BlkHWRequest = DMA_BREQ_SINGLE_BURST,\
        .Direction = DMA_MEMORY_TO_PERIPH,\
        .SrcInc = DMA_SINC_INCREMENTED,\
        .DestInc = DMA_DINC_FIXED,\
        .SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD,\
        .DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD,\
        .SrcBurstLength = 1,\
        .DestBurstLength = 1,\
        .TransferEventMode = DMA_TCEM_EACH_LL_ITEM_TRANSFER,\
        .Priority = DMA_LOW_PRIORITY_LOW_WEIGHT,\
        .Mode = DMA_NORMAL,\
    },\
    .InitLinkedList = {\
        .Priority = DMA_LOW_PRIORITY_MID_WEIGHT,\
        .LinkStepMode = DMA_LSM_FULL_EXECUTION,\
        .LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0,\
        .TransferEventMode = DMA_TCEM_EACH_LL_ITEM_TRANSFER,\
        .LinkedListMode = DMA_LINKEDLIST_CIRCULAR,\
    },\
};\
SAI_DMA_CFG_DEFINE(sai, dma, ch, tx)

#define SAI_DMA_RX_DEFINE(sai, dma, ch) \
SAI_DMA_ISR_DEFINE(sai, dma, ch, rx)\
DMA_HandleTypeDef sai##_rx_GPDMA##dma##_Channel##ch = {\
    .Instance = GPDMA##dma##_Channel##ch,\
    .Init = {\
        .Request = GPDMA1_REQUEST_##sai,\
        .BlkHWRequest = DMA_BREQ_SINGLE_BURST,\
        .Direction = DMA_PERIPH_TO_MEMORY,\
        .SrcInc = DMA_SINC_FIXED,\
        .DestInc = DMA_DINC_INCREMENTED,\
        .SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD,\
        .DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD,\
        .SrcBurstLength = 1,\
        .DestBurstLength = 1,\
        .TransferEventMode = DMA_TCEM_BLOCK_TRANSFER,\
        .Priority = DMA_LOW_PRIORITY_LOW_WEIGHT,\
        .Mode = DMA_LINKEDLIST_CIRCULAR,\
    },\
    .InitLinkedList = {\
    },\
};\
