apache/mynewt-core/hw/drivers/i2s/sai_stm32/src/sai_stm32.c
SAI_DMA_CFG_DEFINE(sai, dma, ch, rx)

SAI_DMA_TX_DEFINE(SAI1_A, 1, 0);
SAI_DMA_TX_DEFINE(SAI1_A, 1, 1);
SAI_DMA_TX_DEFINE(SAI1_A, 1, 2);
SAI_DMA_TX_DEFINE(SAI1_A, 1, 3);
SAI_DMA_TX_DEFINE(SAI1_A, 1, 4);
SAI_DMA_TX_DEFINE(SAI1_A, 1, 5);

SAI_DMA_TX_DEFINE(SAI1_B, 1, 0);
SAI_DMA_TX_DEFINE(SAI1_B, 1, 1);
SAI_DMA_TX_DEFINE(SAI1_B, 1, 2);
SAI_DMA_TX_DEFINE(SAI1_B, 1, 3);
SAI_DMA_TX_DEFINE(SAI1_B, 1, 4);
SAI_DMA_TX_DEFINE(SAI1_B, 1, 5);

SAI_DMA_TX_DEFINE(SAI2_A, 1, 0);
SAI_DMA_TX_DEFINE(SAI2_A, 1, 1);
SAI_DMA_TX_DEFINE(SAI2_A, 1, 2);
SAI_DMA_TX_DEFINE(SAI2_A, 1, 3);
SAI_DMA_TX_DEFINE(SAI2_A, 1, 4);
SAI_DMA_TX_DEFINE(SAI2_A, 1, 5);

SAI_DMA_TX_DEFINE(SAI2_B, 1, 0);
SAI_DMA_TX_DEFINE(SAI2_B, 1, 1);
SAI_DMA_TX_DEFINE(SAI2_B, 1, 2);
SAI_DMA_TX_DEFINE(SAI2_B, 1, 3);
SAI_DMA_TX_DEFINE(SAI2_B, 1, 4);
SAI_DMA_TX_DEFINE(SAI2_B, 1, 5);

SAI_DMA_RX_DEFINE(SAI1_A, 1, 0);
SAI_DMA_RX_DEFINE(SAI1_A, 1, 1);
SAI_DMA_RX_DEFINE(SAI1_A, 1, 2);
SAI_DMA_RX_DEFINE(SAI1_A, 1, 3);
SAI_DMA_RX_DEFINE(SAI1_A, 1, 4);
SAI_DMA_RX_DEFINE(SAI1_A, 1, 5);
SAI_DMA_RX_DEFINE(SAI1_B, 1, 0);
SAI_DMA_RX_DEFINE(SAI1_B, 1, 1);
SAI_DMA_RX_DEFINE(SAI1_B, 1, 2);
SAI_DMA_RX_DEFINE(SAI1_B, 1, 3);
SAI_DMA_RX_DEFINE(SAI1_B, 1, 4);
SAI_DMA_RX_DEFINE(SAI1_B, 1, 5);
SAI_DMA_RX_DEFINE(SAI2_A, 1, 0);
SAI_DMA_RX_DEFINE(SAI2_A, 1, 1);
SAI_DMA_RX_DEFINE(SAI2_A, 1, 2);
SAI_DMA_RX_DEFINE(SAI2_A, 1, 3);
SAI_DMA_RX_DEFINE(SAI2_A, 1, 4);
SAI_DMA_RX_DEFINE(SAI2_A, 1, 5);
SAI_DMA_RX_DEFINE(SAI2_B, 1, 0);
SAI_DMA_RX_DEFINE(SAI2_B, 1, 1);
SAI_DMA_RX_DEFINE(SAI2_B, 1, 2);
SAI_DMA_RX_DEFINE(SAI2_B, 1, 3);
SAI_DMA_RX_DEFINE(SAI2_B, 1, 4);
SAI_DMA_RX_DEFINE(SAI2_B, 1, 5);

SAI_IRQ_DEFINE(SAI1);
SAI_IRQ_DEFINE(SAI2);
#ifdef SAI3
SAI_IRQ_DEFINE(SAI3);
#endif

#define SAI_TX(sai_num, block) \
stm32_sai_t _SAI##sai_num##_##block##_tx = {\
    .hsai.Instance = SAI##sai_num##_Block_##block,\
    .hsai.Init.AudioMode = SAI_MODEMASTER_TX,\
    .hsai.Init.Synchro = SAI_ASYNCHRONOUS,\
    .hsai.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE,\
    .hsai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE,\
    .hsai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY,\
    .hsai.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_48K,\
    .hsai.Init.SynchroExt = SAI_SYNCEXT_DISABLE,\
    .hsai.Init.MonoStereoMode = SAI_STEREOMODE,\
    .hsai.Init.CompandingMode = SAI_NOCOMPANDING,\
    .hsai.Init.TriState = SAI_OUTPUT_RELEASED,\
    .clock = SAI##sai_num##_clock,\
    .irq_cfg = &SAI##sai_num##_irq_def,\
};

#define SAI_RX(sai_num, block) \
stm32_sai_t _SAI##sai_num##_##block##_rx = {\
    .hsai.Instance = SAI##sai_num##_Block_##block,\
    .hsai.Init.AudioMode = SAI_MODEMASTER_RX,\
    .hsai.Init.Synchro = SAI_ASYNCHRONOUS,\
    .hsai.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE,\
    .hsai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE,\
    .hsai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY,\
    .hsai.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_48K,\
    .hsai.Init.SynchroExt = SAI_SYNCEXT_DISABLE,\
    .hsai.Init.MonoStereoMode = SAI_STEREOMODE,\
    .hsai.Init.CompandingMode = SAI_NOCOMPANDING,\
    .hsai.Init.TriState = SAI_OUTPUT_RELEASED,\
    .clock = SAI##sai_num##_clock,\
    .irq_cfg = &SAI##sai_num##_irq_def,\
};

SAI_TX(1, A)
SAI_TX(1, B)
SAI_TX(2, A)
SAI_TX(2, B)
#ifdef SAI3
SAI_TX(3, A)
SAI_TX(3, B)
#endif

SAI_RX(1, A)
SAI_RX(1, B)
SAI_RX(2, A)
SAI_RX(2, B)
#ifdef SAI3
SAI_RX(3, A)
SAI_RX(3, B)
#endif

void
SAI1_IRQHandler(void)
{
    os_trace_isr_enter();

    if (SAI1_Block_A->SR & SAI1_Block_A->IMR) {
        HAL_SAI_IRQHandler(&SAI1_A_tx->hsai);
    }
    if (SAI1_Block_B->SR & SAI1_Block_B->IMR) {
        HAL_SAI_IRQHandler(&SAI1_B_tx->hsai);
    }

    os_trace_isr_exit();
}

void
SAI2_IRQHandler(void)
{
    os_trace_isr_enter();

    if (SAI2_Block_A->SR & SAI2_Block_A->IMR) {
        HAL_SAI_IRQHandler(&SAI2_A_tx->hsai);
    }
    if (SAI2_Block_B->SR & SAI2_Block_B->IMR) {
        HAL_SAI_IRQHandler(&SAI2_B_tx->hsai);
    }

    os_trace_isr_exit();
}

#ifdef SAI3
void
SAI3_IRQHandler(void)
{
    os_trace_isr_enter();

    if (SAI2_Block_A->SR & SAI2_Block_A->IMR) {
        HAL_SAI_IRQHandler(&SAI3_A_tx->hsai);
    }
    if (SAI2_Block_B->SR & SAI2_Block_B->IMR) {
        HAL_SAI_IRQHandler(&SAI3_B_tx->hsai);
    }

    os_trace_isr_exit();
}

SAI_IRQ_DEFINE(SAI3);
#endif

#if I2S_FULLDUPLEX_SUPPORT
void
HAL_I2SEx_TxRxCpltCallback(I2S_HandleTypeDef *hi2s)
{
    /* TODO: Finish full duplex mode */
    assert(0);
}
#endif

void
SAI1_A_rx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI1_A_rx->hdma_sai_rx);

    os_trace_isr_exit();
}

void
SAI1_A_tx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI1_A_tx->hdma_sai_tx);

    os_trace_isr_exit();
}

void
SAI1_B_rx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI1_B_rx->hdma_sai_rx);

    os_trace_isr_exit();
}

void
SAI1_B_tx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI2_B_tx->hdma_sai_tx);

    os_trace_isr_exit();
}

void
SAI2_A_rx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI2_A_rx->hdma_sai_rx);

    os_trace_isr_exit();
}

void
SAI2_A_tx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI2_A_tx->hdma_sai_tx);

    os_trace_isr_exit();
}

void
SAI2_B_rx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI2_B_rx->hdma_sai_rx);

    os_trace_isr_exit();
}

void
SAI2_B_tx_dma_isr(void)
{
    os_trace_isr_enter();

    HAL_DMA_IRQHandler(SAI2_B_tx->hdma_sai_tx);

    os_trace_isr_exit();
}

static void
sai_init_interrupts(const sai_cfg_t *cfg)
{
    if (cfg->rx_dma_cfg) {
        nvic_config_isr(cfg->rx_dma_cfg->irq_cfg);
    }
    if (cfg->tx_dma_cfg) {
        nvic_config_isr(cfg->tx_dma_cfg->irq_cfg);
    }

    /* SAIx interrupt Init */
    nvic_config_isr(cfg->sai->irq_cfg);
}

static void
sai_init_pins(struct stm32_sai_pins *pins)
{
    hal_gpio_init_out(MCU_GPIO_PORTD(11), 0);
    hal_gpio_init_out(MCU_GPIO_PORTD(12), 0);
    hal_gpio_init_out(MCU_GPIO_PORTD(13), 0);
    for (int i = 0; i < 16; i++) {
        hal_gpio_write(MCU_GPIO_PORTD(11), 1);
        hal_gpio_write(MCU_GPIO_PORTD(12), 1);
        hal_gpio_write(MCU_GPIO_PORTD(13), 1);
        hal_gpio_write(MCU_GPIO_PORTD(11), 0);
        hal_gpio_write(MCU_GPIO_PORTD(12), 0);
        hal_gpio_write(MCU_GPIO_PORTD(13), 0);
    }

    stm32_pin_config(pins->fs_pin);
    stm32_pin_config(pins->mck_pin);
    stm32_pin_config(pins->sck_pin);
    stm32_pin_config(pins->sdi_pin);
    stm32_pin_config(pins->sdo_pin);
}

static int
stm32_sai_init(struct i2s *i2s, const sai_cfg_t *cfg)
{
    int rc = 0;
    struct stm32_sai *stm32_sai;

#if I2S_FULLDUPLEX_SUPPORT
    if (cfg->pins.ext_sd_pin != NULL) {
        i2s->direction = I2S_OUT_IN;
    } else {
        i2s->direction = ((cfg->mode == I2S_MODE_MASTER_TX) ||
                          (cfg->mode == I2S_MODE_SLAVE_TX)) ? I2S_OUT : I2S_IN;
    }
#else
    i2s->direction = cfg->direction;
#endif

    if (cfg->data_size <= SAI_PROTOCOL_DATASIZE_16BITEXTENDED) {
        i2s->sample_size_in_bytes = 2;
    } else {
        i2s->sample_size_in_bytes = 4;
    }

