apache/mynewt-core/hw/drivers/i2s/sai_stm32/src/sai_stm32.c
    rc = i2s_init(i2s, cfg->pool);

    if (rc != OS_OK) {
        goto end;
    }

    stm32_sai = cfg->sai;
    stm32_sai->i2s = i2s;
    // stm32_sai->hdma_spi = cfg->hdma_spi; ???
#if I2S_FULLDUPLEX_SUPPORT
    stm32_sai->hdma_i2sext = cfg->spi_cfg->hdma_i2sext;
#endif

    i2s->sample_rate = cfg->sample_rate;
    i2s->driver_data = stm32_sai;

    sai_init_pins((struct stm32_sai_pins *)&cfg->pins);

    stm32_clock_enable(cfg->sai_clock_src);
    stm32_clock_enable(stm32_sai->clock);
    if (cfg->rx_dma_cfg) {
        stm32_sai->hdma_sai_rx = cfg->rx_dma_cfg->dma_channel;
        nvic_config_isr(cfg->rx_dma_cfg->irq_cfg);
        stm32_clock_enable(cfg->rx_dma_cfg->clock);
    }
    if (cfg->tx_dma_cfg) {
        stm32_sai->hdma_sai_tx = cfg->tx_dma_cfg->dma_channel;
        nvic_config_isr(cfg->tx_dma_cfg->irq_cfg);
        stm32_clock_enable(cfg->tx_dma_cfg->clock);
    }

#if I2S_FULLDUPLEX_SUPPORT
    if (i2s->direction == I2S_OUT_IN) {
        stm32_sai->hdma_i2sext->Instance = cfg->dma_i2sext_cfg->dma_stream;
        stm32_sai->hdma_i2sext->Init.Channel = cfg->dma_i2sext_cfg->dma_channel;
        if (cfg->mode == I2S_MODE_MASTER_TX || cfg->mode == I2S_MODE_SLAVE_TX) {
            stm32_sai->hdma_i2sext->Init.Direction = DMA_PERIPH_TO_MEMORY;
            __HAL_LINKDMA(&stm32_sai->hi2s, hdmarx, *stm32_sai->hdma_i2sext);
        } else {
            stm32_sai->hdma_i2sext->Init.Direction = DMA_MEMORY_TO_PERIPH;
            __HAL_LINKDMA(&stm32_sai->hi2s, hdmatx, *stm32_sai->hdma_i2sext);
        }
        stm32_sai->hdma_i2sext->Init.PeriphInc = DMA_PINC_DISABLE;
        stm32_sai->hdma_i2sext->Init.MemInc = DMA_MINC_ENABLE;
        stm32_sai->hdma_i2sext->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
        stm32_sai->hdma_i2sext->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
        stm32_sai->hdma_i2sext->Init.Mode = DMA_NORMAL;
        stm32_sai->hdma_i2sext->Init.Priority = DMA_PRIORITY_LOW;
        stm32_sai->hdma_i2sext->Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    }
#endif

    sai_init_interrupts(cfg);
end:
    return rc;
}

int
sai_create(struct i2s *i2s, const char *name, const sai_cfg_t *cfg)
{
    return os_dev_create(&i2s->dev, name, OS_DEV_INIT_PRIMARY,
                         100, (os_dev_init_func_t)stm32_sai_init, (void *)cfg);
}

int
i2s_create(struct i2s *i2s, const char *name, const sai_cfg_t *cfg)
{
    return os_dev_create(&i2s->dev, name, OS_DEV_INIT_PRIMARY,
                         100, (os_dev_init_func_t)stm32_sai_init, (void *)cfg);
}

int
i2s_driver_stop(struct i2s *i2s)
{
    struct stm32_sai *sai_data = (struct stm32_sai *)i2s->driver_data;
    struct i2s_sample_buffer *buffer;

    HAL_SAI_DMAStop(&sai_data->hsai);
    if (i2s->state == I2S_STATE_RUNNING && i2s->direction == I2S_OUT) {
        /*
         * When DMA is stopped and then I2S peripheral is stopped, it
         * may happen that DMA put some data already in SPI data buffer.
         * In that case single sample may be in the I2S output buffer.
         * If this happens next transmission will swap channels due to
         * one extra sample already present.
         * To avoid this just wait till all samples are gone.
         */
        // if (0 == (i2s_data->hsai.Instance->SR & SAI_SR_TXP_Msk)) {
        //     __HAL_I2S_ENABLE(&i2s_data->hi2s);
        //     while (0 == (i2s_data->hi2s.Instance->SR & SPI_SR_TXP_Msk))
        //         ;
        //     __HAL_I2S_DISABLE(&i2s_data->hi2s);
        // }
    }

    assert(sai_data->hsai.State == HAL_SAI_STATE_READY);
    if (sai_data->dma_buffer_count > 0) {
        buffer = sai_data->dma_buffers[0];
        sai_data->dma_buffers[0] = NULL;
        i2s_driver_buffer_put(i2s, buffer);
        if (sai_data->dma_buffer_count > 1) {
            buffer = sai_data->dma_buffers[1];
            i2s_driver_buffer_put(i2s, buffer);
        }
        sai_data->dma_buffers[1] = NULL;
        sai_data->dma_buffer_count = 0;
    }
    HAL_SAI_DeInit(&sai_data->hsai);
    if (sai_data->hdma_sai_rx) {
        HAL_DMA_DeInit(sai_data->hdma_sai_rx);
    }
    if (sai_data->hdma_sai_tx) {
        HAL_DMA_DeInit(sai_data->hdma_sai_tx);
    }

    return 0;
}

static int
active_buffer_ix(struct stm32_sai *sai_data)
{
    int ix = (sai_data->hsai.hdmatx->Instance->CLLR & 0xFFFF) == (0xFFFF & (uint32_t)(&sai_data->nodes[1])) ? 0 : 1;

    return ix;
}

static void
set_dma_address(struct stm32_sai *sai_data, int ix, void *address)
{
    sai_data->nodes[ix].LinkRegisters[NODE_CSAR_DEFAULT_OFFSET] = (uint32_t)address;
}

/* Callback for when a buffer finishes transmitting */
void HAL_SAI_TxCpltCallback(SAI_HandleTypeDef *hsai)
{
    struct stm32_sai *sai_data = (struct stm32_sai *)hsai;
    struct i2s *i2s = sai_data->i2s;
    struct i2s_sample_buffer *processed_buffer = NULL;
    static struct i2s_sample_buffer *next_buffer;
    int ix;

    hal_gpio_write(ARDUINO_PIN_D10, 1);

    /* Get inactive DMA node index */
    ix = active_buffer_ix(sai_data) ^ 1;

    /* Get associated i2s_buffer (can be NULL) */
    processed_buffer = sai_data->dma_buffers[ix];
    /* Get next buffer queuesd to the driver and set it to DMA */
    next_buffer = i2s_driver_buffer_get(i2s);
    sai_data->dma_buffers[ix] = next_buffer;

    /* Set DMA address of inactive Node to next buffer data or zero_buffer if buffer */
    set_dma_address(sai_data, ix, next_buffer ? next_buffer->sample_data : zero_buffer);

    /* Buffer depende on presence of next and previous buffer */
    sai_data->dma_buffer_count += (processed_buffer ? -1 : 0) + (next_buffer ? 1 : 0);

    /* Return processed buffer */
    if (processed_buffer) {
        processed_buffer->sample_count = processed_buffer->capacity;
        i2s_driver_buffer_put(i2s, processed_buffer);
    }

    if (processed_buffer != NULL && sai_data->dma_buffer_count == 0) {
        /* Run out of buffers */
        stm32_pin_pulse(PF3);
        i2s->client->state_changed_cb(i2s, I2S_STATE_OUT_OF_BUFFERS);
    }
    hal_gpio_write(ARDUINO_PIN_D10, 0);
}

/* Callback for when a buffer finishes receiving */
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
    struct stm32_sai *sai_data = (struct stm32_sai *)hsai;
    struct i2s *i2s = sai_data->i2s;
    struct i2s_sample_buffer *processed_buffer = NULL;
    static struct i2s_sample_buffer *next_buffer;
    int ix;

    hal_gpio_write(ARDUINO_PIN_D10, 1);

    /* Get inactive DMA node index */
    ix = active_buffer_ix(sai_data) ^ 1;

    /* Get associated i2s_buffer (can be NULL) */
    processed_buffer = sai_data->dma_buffers[ix];
    /* Get next buffer queuesd to the driver and set it to DMA */
    next_buffer = i2s_driver_buffer_get(i2s);
    sai_data->dma_buffers[ix] = next_buffer;

    /* Set DMA address of inactive Node to next buffer data or zero_buffer if buffer */
    set_dma_address(sai_data, ix, next_buffer ? next_buffer->sample_data : zero_buffer);

    /* Buffer depende on presence of next and previous buffer */
    sai_data->dma_buffer_count += (processed_buffer ? -1 : 0) + (next_buffer ? 1 : 0);

    /* Return processed buffer */
    if (processed_buffer) {
        processed_buffer->sample_count = processed_buffer->capacity;
        i2s_driver_buffer_put(i2s, processed_buffer);
    }

    if (processed_buffer != NULL && sai_data->dma_buffer_count == 0) {
        /* Run out of buffers */
        stm32_pin_pulse_n(PF3, 4);
        i2s->client->state_changed_cb(i2s, I2S_STATE_OUT_OF_BUFFERS);
    }
    hal_gpio_write(ARDUINO_PIN_D10, 0);
}

