apache/mynewt-core/hw/drivers/i2s/sai_stm32/src/sai_stm32.c
// static void
// sai_dma_complete(DMA_HandleTypeDef *hdma, HAL_DMA_MemoryTypeDef memory)
// {
//     SAI_HandleTypeDef *hsai = (SAI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */
//     struct stm32_sai *sai_data = (struct stm32_sai *)hsai;
//     struct i2s *i2s = sai_data->i2s;
//     struct i2s_sample_buffer *processed_buffer = NULL;
//     const int ix = (int)memory;
//
//     if (sai_data->dma_buffer_count == 2) {
//         /* There were already two different memory buffers, one can be returned to the user */
//         processed_buffer = sai_data->dma_buffers[ix];
//         sai_data->dma_buffers[ix] = i2s_driver_buffer_get(i2s);
//         /* If there are not more waiting buffers, use same buffer again */
//         if (sai_data->dma_buffers[ix] == NULL) {
//             sai_data->dma_buffer_count = 1;
//             sai_data->dma_buffers[ix] = sai_data->dma_buffers[ix ^ 1];
//         }
//         HAL_DMAEx_List_SetCircularModeConfig()
//         HAL_DMAEx_ChangeMemory(hdma, (uint32_t)sai_data->dma_buffers[ix]->sample_data, memory);
//         processed_buffer->sample_count = processed_buffer->capacity;
//         i2s_driver_buffer_put(i2s, processed_buffer);
//     }
// }

/*
 * Following functions:
 * i2s_dma_error(), i2s_receive_start_dma() i2s_transmit_start_dma(), i2s_transmit_receive_dma()
 * are close copies of ST HAL functions with exception that they program DMA in double buffering
 * mode.  Style and naming is in most part unchanged.
 */
void
sai_dma_error(DMA_HandleTypeDef *hdma)
{
//     SAI_HandleTypeDef *hsai = (SAI_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent; /* Derogation MISRAC2012-Rule-11.5 */
//
//     /* Disable Rx and Tx DMA Request */
//     CLEAR_BIT(hi2s->Instance->CFG1, (SPI_CFG1_RXDMAEN | SPI_CFG1_TXDMAEN));
//     hsai->TxXferCount = 0U;
//     hsai->RxXferCount = 0U;
//
//     hsai->State = HAL_SAI_STATE_READY;
//
//     /* Set the error code and execute error callback */
//     SET_BIT(hsai->ErrorCode, HAL_SAI_ERROR_DMA);
//     /* Call user error callback */
// #if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
//     hsai->ErrorCallback(hi2s);
// #else
//     HAL_SAI_ErrorCallback(hsai);
// #endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

static HAL_StatusTypeDef
sai_receive_start_dma(stm32_sai_t *sai_data)
{
    HAL_StatusTypeDef ret;
    struct i2s_sample_buffer *buffer = sai_data->dma_buffers[1];

    if (buffer != NULL) {
        set_dma_address(sai_data, 1, buffer->sample_data);
    } else {
        set_dma_address(sai_data, 1, zero_buffer);
    }

    buffer = sai_data->dma_buffers[0];
    ret = HAL_SAI_Receive_DMA(&sai_data->hsai, buffer->sample_data, buffer->capacity);

    return ret;
}

static HAL_StatusTypeDef
sai_transmit_start_dma(stm32_sai_t *sai_data)
{
    HAL_StatusTypeDef ret;
    struct i2s_sample_buffer *buffer = sai_data->dma_buffers[1];

    if (buffer != NULL) {
        set_dma_address(sai_data, 1, buffer->sample_data);
    } else {
        set_dma_address(sai_data, 1, zero_buffer);
    }

    buffer = sai_data->dma_buffers[0];
    ret = HAL_SAI_Transmit_DMA(&sai_data->hsai, buffer->sample_data, buffer->sample_count);

    return ret;
}

#if I2S_FULLDUPLEX_SUPPORT
static HAL_StatusTypeDef
i2s_transmit_receive_dma(I2S_HandleTypeDef *hi2s, uint16_t *buf0, uint16_t *buf1, uint16_t sample_count)
{
    uint32_t tmp1 = 0U;
    HAL_StatusTypeDef errorcode = HAL_OK;
    uint16_t size;

    if (hi2s->State != HAL_I2S_STATE_READY) {
        errorcode = HAL_BUSY;
        goto error;
    }

    if ((buf0 == NULL) || (buf1 == NULL) || (sample_count == 0U)) {
        return HAL_ERROR;
    }

    /* Process Locked */
    __HAL_LOCK(hi2s);

    hi2s->pTxBuffPtr = buf0;
    hi2s->pRxBuffPtr = buf0;

    tmp1 = hi2s->Instance->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN);
    /*
     * Check the Data format: When a 16-bit data frame or a 16-bit data frame extended
     * is selected during the I2S configuration phase, the Size parameter means the number
     * of 16-bit data length in the transaction and when a 24-bit data frame or a 32-bit data
     * frame is selected the Size parameter means the number of 16-bit data length.
     */
    if ((tmp1 == I2S_DATAFORMAT_24B) || (tmp1 == I2S_DATAFORMAT_32B)) {
        size = sample_count << 1U;
    } else {
        size = sample_count;
    }
    hi2s->TxXferSize = size;
    hi2s->TxXferCount = size;
    hi2s->RxXferSize = size;
    hi2s->RxXferCount = size;

    hi2s->ErrorCode = HAL_I2S_ERROR_NONE;
    hi2s->State = HAL_I2S_STATE_BUSY_TX_RX;

    /* No Half transfer needed */
    hi2s->hdmarx->XferHalfCpltCallback = NULL;
    hi2s->hdmatx->XferHalfCpltCallback = NULL;

    /* Set the I2S Rx DMA transfer complete callback */
    hi2s->hdmarx->XferCpltCallback = sai_dma_m0_complete;
    hi2s->hdmarx->XferM1CpltCallback = sai_dma_m1_complete;

    /* Set the I2S Rx DMA error callback */
    hi2s->hdmarx->XferErrorCallback = sai_dma_error;

    hi2s->hdmarx->Instance->CR &= ~DMA_SxCR_CT_Msk;

    /* Set the I2S Tx DMA transfer complete callback */
    hi2s->hdmatx->XferCpltCallback = sai_dma_m0_complete;
    hi2s->hdmatx->XferM1CpltCallback = sai_dma_m1_complete;

    /* Set the I2S Tx DMA error callback */
    hi2s->hdmatx->XferErrorCallback = sai_dma_error;

    hi2s->hdmatx->Instance->CR &= ~DMA_SxCR_CT_Msk;

    tmp1 = hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SCFG;
    /* Check if the I2S_MODE_MASTER_TX or I2S_MODE_SLAVE_TX Mode is selected */
    if ((tmp1 == I2S_MODE_MASTER_TX) || (tmp1 == I2S_MODE_SLAVE_TX)) {
        /* Enable the Rx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmarx, (uint32_t)&I2SxEXT(hi2s->Instance)->DR,
                                      (uint32_t)buf0, (uint32_t)buf1, size);

        /* Enable Rx DMA Request */
        SET_BIT(I2SxEXT(hi2s->Instance)->CR2, SPI_CR2_RXDMAEN);

        /* Enable the Tx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmatx, (uint32_t)buf0, (uint32_t)&hi2s->Instance->DR,
                                      (uint32_t)buf1, size);

        /* Enable Tx DMA Request */
        SET_BIT(hi2s->Instance->CR2, SPI_CR2_TXDMAEN);

