apache/mynewt-core/hw/drivers/i2s/sai_stm32/src/sai_stm32.c
        /* Check if the I2S is already enabled */
        if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SE) != SPI_I2SCFGR_I2SE) {
            /* Enable I2Sext(receiver) before enabling I2Sx peripheral */
            __HAL_I2SEXT_ENABLE(hi2s);

            /* Enable I2S peripheral after the I2Sext */
            __HAL_I2S_ENABLE(hi2s);
        }
    } else {
        /* Check if Master Receiver mode is selected */
        if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SCFG) == I2S_MODE_MASTER_RX) {
            /*
             * Clear the Overrun Flag by a read operation on the SPI_DR register followed by a read
             * access to the SPI_SR register.
             */
            __HAL_I2S_CLEAR_OVRFLAG(hi2s);
        }
        /* Enable the Tx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmatx, (uint32_t)buf0, (uint32_t)&I2SxEXT(hi2s->Instance)->DR,
                                      (uint32_t)buf1, size);

        /* Enable Tx DMA Request */
        SET_BIT(I2SxEXT(hi2s->Instance)->CR2, SPI_CR2_TXDMAEN);

        /* Enable the Rx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmarx, (uint32_t)&hi2s->Instance->DR, (uint32_t)buf0,
                                      (uint32_t)buf1, size);

        /* Enable Rx DMA Request */
        SET_BIT(hi2s->Instance->CR2, SPI_CR2_RXDMAEN);

        /* Check if the I2S is already enabled */
        if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SE) != SPI_I2SCFGR_I2SE) {
            /* Enable I2Sext(transmitter) before enabling I2Sx peripheral */
            __HAL_I2SEXT_ENABLE(hi2s);
            /* Enable I2S peripheral before the I2Sext */
            __HAL_I2S_ENABLE(hi2s);
        }
    }

error:
    __HAL_UNLOCK(hi2s);
    return errorcode;
}
#endif

void sai_dma_init(struct stm32_sai *sai_data)
{
    DMA_NodeConfTypeDef nodeConfig = {0};

    __HAL_RCC_GPDMA1_CLK_ENABLE();

    /* Basic Node Configuration */
    nodeConfig.NodeType = DMA_GPDMA_LINEAR_NODE;
    /* Take DMA Node configuration from DMA init struct */
    nodeConfig.Init = sai_data->hdma_sai_tx->Init;

    /* Build the Linked List Queue */
    memset(&sai_data->dma_list, 0, sizeof(sai_data->dma_list));

    nodeConfig.SrcAddress = (uint32_t)zero_buffer;
    nodeConfig.DstAddress = (uint32_t)&sai_data->hsai.Instance->DR;
    nodeConfig.DataSize = 192;

    HAL_DMAEx_List_BuildNode(&nodeConfig, &sai_data->nodes[0]);
    HAL_DMAEx_List_BuildNode(&nodeConfig, &sai_data->nodes[1]);
    HAL_DMAEx_List_InsertNode_Tail(&sai_data->dma_list, &sai_data->nodes[0]);
    HAL_DMAEx_List_InsertNode_Tail(&sai_data->dma_list, &sai_data->nodes[1]);
    HAL_DMAEx_List_SetCircularMode(&sai_data->dma_list);
    HAL_DMAEx_List_Init(sai_data->hdma_sai_tx);
    HAL_DMAEx_List_LinkQ(sai_data->hdma_sai_tx, &sai_data->dma_list);

    /* Link DMA handle */
    __HAL_LINKDMA(&sai_data->hsai, hdmatx, *sai_data->hdma_sai_tx);
}

int
i2s_driver_start(struct i2s *i2s)
{
    int rc = 0;
    struct stm32_sai *sai_data = (struct stm32_sai *)i2s->driver_data;

    switch (sai_data->hsai.State) {
    case HAL_SAI_STATE_RESET:
        if (i2s->sample_rate) {
            sai_data->hsai.Init.AudioFrequency = i2s->sample_rate;
        }
        if (HAL_SAI_Init(&sai_data->hsai) != HAL_OK) {
            rc = SYS_EUNKNOWN;
            break;
        }
        sai_dma_init(sai_data);
        HAL_SAI_InitProtocol(&sai_data->hsai, SAI_I2S_STANDARD, SAI_PROTOCOL_DATASIZE_16BIT, 2);
        // if (HAL_DMA_Init(sai_data->hdma_spi) != HAL_OK) {
        //     (void)HAL_I2S_DeInit(&sai_data->hi2s);
        //     rc = SYS_EUNKNOWN;
        //     break;
        // }
#if I2S_FULLDUPLEX_SUPPORT
        if (i2s->direction == I2S_OUT_IN) {
            if (HAL_DMA_Init(sai_data->hdma_i2sext) != HAL_OK) {
                (void)HAL_DMA_DeInit(sai_data->hdma_spi);
                (void)HAL_I2S_DeInit(&sai_data->hi2s);
                rc = SYS_EUNKNOWN;
                break;
            }
        }
#endif
    /* Fallthrough */
    case HAL_SAI_STATE_READY:
        assert(sai_data->dma_buffers[0] == NULL);
        assert(sai_data->dma_buffers[1] == NULL);
        assert(sai_data->dma_buffer_count == 0);
        sai_data->dma_buffers[0] = i2s_driver_buffer_get(i2s);
        sai_data->dma_buffers[1] = i2s_driver_buffer_get(i2s);
        if (sai_data->dma_buffers[0] == NULL) {
            i2s->state = I2S_STATE_OUT_OF_BUFFERS;
            rc = I2S_ERR_NO_BUFFER;
            break;
        }
        if (sai_data->dma_buffers[1] == NULL) {
            sai_data->dma_buffer_count = 1;
        } else {
            sai_data->dma_buffer_count = 2;
        }
        i2s->state = I2S_STATE_RUNNING;
        if (i2s->direction == I2S_IN) {
            sai_data->dma_buffers[0]->sample_count = sai_data->dma_buffers[0]->capacity;
            sai_receive_start_dma(sai_data);
            assert(sai_data->dma_buffers[0]->capacity == sai_data->dma_buffers[1]->capacity);
        } else if (i2s->direction == I2S_OUT) {
            sai_transmit_start_dma(sai_data);
        } else {
#if I2S_FULLDUPLEX_SUPPORT
            i2s_transmit_receive_dma(&sai_data->hi2s,
                                     sai_data->dma_buffers[0]->sample_data,
                                     sai_data->dma_buffers[1]->sample_data,
                                     sai_data->dma_buffers[0]->sample_count);
#endif
        }
        break;
    case HAL_SAI_STATE_BUSY:
    case HAL_SAI_STATE_BUSY_RX:
    case HAL_SAI_STATE_BUSY_TX:
        break;
    default:
        rc = I2S_ERR_INTERNAL;
    }
    return rc;
}

void
i2s_driver_buffer_queued(struct i2s *i2s)
{
    struct stm32_sai *sai_data = (struct stm32_sai *)i2s->driver_data;
    struct i2s_sample_buffer *buffer;
    int sr;
    int ix;

    hal_gpio_write(ARDUINO_PIN_D9, 1);
    hal_gpio_write(ARDUINO_PIN_D9, 0);

    if (0) {
    if (i2s->state != I2S_STATE_RUNNING) {
        return;
    }
    OS_ENTER_CRITICAL(sr);
    switch (sai_data->dma_buffer_count) {
    case 0:
        /* Driver run out of buffer before and operates on zero_buffer */
        buffer = i2s_driver_buffer_get(i2s);
        /* Get inactive buffer */
        ix = active_buffer_ix(sai_data) ^ 1;
        assert(sai_data->dma_buffers[ix] == NULL);
        sai_data->dma_buffers[ix] = buffer;
        set_dma_address(sai_data, ix, buffer->sample_data);
        sai_data->dma_buffer_count = 1;
        break;
    case 1:
        buffer = i2s_driver_buffer_get(i2s);
        if ((sai_data->hsai.hdmatx->Instance->CCR & DMA_CCR_EN) == 0) {
            stm32_pin_pulse_n(PF3, 3);
            ix = 1;
        } else {
            ix = active_buffer_ix(sai_data) ^ 1;
        }
        assert(sai_data->dma_buffers[ix] == NULL);
        assert(buffer != NULL);
        if (buffer) {
            stm32_pin_pulse(PF3);
            sai_data->dma_buffers[ix] = buffer;
            set_dma_address(sai_data, ix, buffer->sample_data);
            sai_data->dma_buffer_count = 2;
        }
        break;
    default:
        break;
    }
    OS_EXIT_CRITICAL(sr);
    }
}

int
i2s_driver_suspend(struct i2s *i2s, os_time_t timeout, int arg)
{
    return OS_OK;
}

int
i2s_driver_resume(struct i2s *i2s)
{
    return OS_OK;
}

// bool
// i2s_out_is_active(struct i2s *i2s)
// {
//     struct stm32_i2s *i2s_data = (struct stm32_i2s *)i2s->driver_data;
//     return READ_BIT(i2s_data->hi2s.Instance->I2SCFGR, SPI_I2SCFGR_I2SE) != 0;
// }
